app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hallo"], ["content", "bester"], ["created_at", "2023-02-21 14:36:05.303679"], ["updated_at", "2023-02-21 14:36:05.303679"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "Aut facere dolores assumenda. Was soll ich noch sagen."], ["updated_at", "2023-02-21 14:35:52.632717"], ["id", 2]]
---
  def update
    @article.update(article_params)